In [30]:
#basic
import pandas as pd
import numpy as np
import datetime
import re

In [2]:
df = pd.read_csv('coast_df.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109535 entries, 0 to 109534
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  109535 non-null  int64
 1   datetime    109535 non-null  object
 2   ercot_load  109534 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.5+ MB

In [4]:
df.head(30)

    Unnamed: 0                    datetime   ercot_load
0            0  2010-01-01 01:00:00.003000  7775.456846
1            1  2010-01-01 01:59:59.997000  7704.815982
2            2         2010-01-01 03:00:00  7650.575724
3            3  2010-01-01 04:00:00.003000  7666.708317
4            4  2010-01-01 04:59:59.997000  7744.960869
5            5         2010-01-01 06:00:00  7980.653429
6            6  2010-01-01 07:00:00.003000  8197.656921
7            7  2010-01-01 07:59:59.997000  8323.466717
8            8         2010-01-01 09:00:00  8445.652540
9            9  2010-01-01 10:00:00.003000  8682.288354
10          10  2010-01-01 10:59:59.997000  8783.462969
11          11         2010-01-01 12:00:00  8810.251800
12          12  2010-01-01 13:00:00.003000  8651.043662
13          13  2010-01-01 13:59:59.997000  8449.118385
14          14         2010-01-01 15:00:00  8222.029420
15          15  2010-01-01 16:00:00.003000  8055.582780
16          16  2010-01-01 16:59:59.997000  8155.932078
17          17         2010-01-01 18:00:00  8620.029504
18          18  2010-01-01 19:00:00.003000  9136.176022
19          19  2010-01-01 19:59:59.997000  9258.353529
20          20         2010-01-01 21:00:00  9204.682507
21          21  2010-01-01 22:00:00.003000  9050.982432
22          22  2010-01-01 22:59:59.997000  8816.746381
23          23         2010-01-02 00:00:00  8515.792400
24          24  2010-01-02 01:00:00.003000  8279.044452
25          25  2010-01-02 01:59:59.997000  8130.664762
26          26         2010-01-02 03:00:00  8049.185313
27          27  2010-01-02 04:00:00.003000  8095.660424
28          28  2010-01-02 04:59:59.997000  8217.184166
29          29         2010-01-02 06:00:00  8436.457676

In [5]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109535 entries, 0 to 109534
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   datetime    109535 non-null  object
 1   ercot_load  109534 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.7+ MB

In [7]:
df.tail()

                datetime    ercot_load
109530  06/30/2022 20:00  14700.132848
109531  06/30/2022 21:00  14637.633680
109532  06/30/2022 22:00  14543.743791
109533  06/30/2022 23:00  14065.386852
109534  06/30/2022 24:00  13484.378935

In [8]:
df[~df.datetime.str.startswith('2')]

                datetime    ercot_load
61368   01/01/2017 01:00   8791.789509
61369   01/01/2017 02:00   8569.708419
61370   01/01/2017 03:00   8326.425638
61371   01/01/2017 04:00   8137.497400
61372   01/01/2017 05:00   8011.869581
...                  ...           ...
109530  06/30/2022 20:00  14700.132848
109531  06/30/2022 21:00  14637.633680
109532  06/30/2022 22:00  14543.743791
109533  06/30/2022 23:00  14065.386852
109534  06/30/2022 24:00  13484.378935

[48167 rows x 2 columns]

In [9]:
df.head(15)

                      datetime   ercot_load
0   2010-01-01 01:00:00.003000  7775.456846
1   2010-01-01 01:59:59.997000  7704.815982
2          2010-01-01 03:00:00  7650.575724
3   2010-01-01 04:00:00.003000  7666.708317
4   2010-01-01 04:59:59.997000  7744.960869
5          2010-01-01 06:00:00  7980.653429
6   2010-01-01 07:00:00.003000  8197.656921
7   2010-01-01 07:59:59.997000  8323.466717
8          2010-01-01 09:00:00  8445.652540
9   2010-01-01 10:00:00.003000  8682.288354
10  2010-01-01 10:59:59.997000  8783.462969
11         2010-01-01 12:00:00  8810.251800
12  2010-01-01 13:00:00.003000  8651.043662
13  2010-01-01 13:59:59.997000  8449.118385
14         2010-01-01 15:00:00  8222.029420

In [10]:
df.shape

(109535, 2)

In [11]:
df.datetime.isna().sum()

0

In [12]:
df.datetime[0]

'2010-01-01 01:00:00.003000'

In [13]:
df.datetime.apply(len).value_counts()

16    48162
26    40912
19    20456
20        5
Name: datetime, dtype: int64

In [14]:
df.datetime.str[:16]

0         2010-01-01 01:00
1         2010-01-01 01:59
2         2010-01-01 03:00
3         2010-01-01 04:00
4         2010-01-01 04:59
                ...
109530    06/30/2022 20:00
109531    06/30/2022 21:00
109532    06/30/2022 22:00
109533    06/30/2022 23:00
109534    06/30/2022 24:00
Name: datetime, Length: 109535, dtype: object

In [15]:
# 1. Datetime to string
# 2. Pull out first 19 characters
df.datetime = df.datetime.str[:16]

df.head(3)

           datetime   ercot_load
0  2010-01-01 01:00  7775.456846
1  2010-01-01 01:59  7704.815982
2  2010-01-01 03:00  7650.575724

In [16]:
df.datetime.str[:10]

0         2010-01-01
1         2010-01-01
2         2010-01-01
3         2010-01-01
4         2010-01-01
             ...
109530    06/30/2022
109531    06/30/2022
109532    06/30/2022
109533    06/30/2022
109534    06/30/2022
Name: datetime, Length: 109535, dtype: object

In [17]:
df.datetime.str[-5:]

0         01:00
1         01:59
2         03:00
3         04:00
4         04:59
          ...
109530    20:00
109531    21:00
109532    22:00
109533    23:00
109534    24:00
Name: datetime, Length: 109535, dtype: object

In [18]:
# 3. Deconstruct into date and time columns
df['date'] = df.datetime.str[:10]
df['time'] = df.datetime.str[-5:]

In [19]:
df

                datetime    ercot_load        date   time
0       2010-01-01 01:00   7775.456846  2010-01-01  01:00
1       2010-01-01 01:59   7704.815982  2010-01-01  01:59
2       2010-01-01 03:00   7650.575724  2010-01-01  03:00
3       2010-01-01 04:00   7666.708317  2010-01-01  04:00
4       2010-01-01 04:59   7744.960869  2010-01-01  04:59
...                  ...           ...         ...    ...
109530  06/30/2022 20:00  14700.132848  06/30/2022  20:00
109531  06/30/2022 21:00  14637.633680  06/30/2022  21:00
109532  06/30/2022 22:00  14543.743791  06/30/2022  22:00
109533  06/30/2022 23:00  14065.386852  06/30/2022  23:00
109534  06/30/2022 24:00  13484.378935  06/30/2022  24:00

[109535 rows x 4 columns]

In [20]:
pd.to_datetime(df.date)

0        2010-01-01
1        2010-01-01
2        2010-01-01
3        2010-01-01
4        2010-01-01
            ...
109530   2022-06-30
109531   2022-06-30
109532   2022-06-30
109533   2022-06-30
109534   2022-06-30
Name: date, Length: 109535, dtype: datetime64[ns]

In [21]:
# 4. Convert date column into datetime format
df['date'] = pd.to_datetime(df.date)
#NOTE: may need to come back here and specify datetime format to store it as
# if date addition or similar doesn't work

df

                datetime    ercot_load       date   time
0       2010-01-01 01:00   7775.456846 2010-01-01  01:00
1       2010-01-01 01:59   7704.815982 2010-01-01  01:59
2       2010-01-01 03:00   7650.575724 2010-01-01  03:00
3       2010-01-01 04:00   7666.708317 2010-01-01  04:00
4       2010-01-01 04:59   7744.960869 2010-01-01  04:59
...                  ...           ...        ...    ...
109530  06/30/2022 20:00  14700.132848 2022-06-30  20:00
109531  06/30/2022 21:00  14637.633680 2022-06-30  21:00
109532  06/30/2022 22:00  14543.743791 2022-06-30  22:00
109533  06/30/2022 23:00  14065.386852 2022-06-30  23:00
109534  06/30/2022 24:00  13484.378935 2022-06-30  24:00

[109535 rows x 4 columns]

In [22]:
# 5. Find any time where starts with 24, then for that index, update time to 00 and add one day to to date column
df.time.str[:2].value_counts()

01    7121
10    7121
22    7121
16    7121
13    7121
19    7121
07    7121
04    7121
09    4564
12    4564
15    4564
06    4564
18    4564
21    4564
03    4558
00    2557
02    2012
05    2007
08    2007
11    2007
14    2007
17    2007
20    2007
23    2007
24    2007
Name: time, dtype: int64

In [23]:
df[df.time.str.startswith('24')]

                datetime    ercot_load       date   time
61391   01/01/2017 24:00   9287.697168 2017-01-01  24:00
61415   01/02/2017 24:00   8935.488453 2017-01-02  24:00
61439   01/03/2017 24:00   8916.940782 2017-01-03  24:00
61463   01/04/2017 24:00   9784.496622 2017-01-04  24:00
61487   01/05/2017 24:00   9959.715620 2017-01-05  24:00
...                  ...           ...        ...    ...
109438  06/26/2022 24:00  16630.511189 2022-06-26  24:00
109462  06/27/2022 24:00  13866.196748 2022-06-27  24:00
109486  06/28/2022 24:00  14675.349674 2022-06-28  24:00
109510  06/29/2022 24:00  14877.471376 2022-06-29  24:00
109534  06/30/2022 24:00  13484.378935 2022-06-30  24:00

[2007 rows x 4 columns]

In [24]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00
61391  01/01/2017 24:00   9287.697168 2017-01-01  24:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00

In [25]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00
109438  06/26/2022 24:00  16630.511189 2022-06-26  24:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00

In [26]:
# 5. Find any time where starts with 24, then for that index, add one day to to date column and update time to 00

In [27]:
df.loc[df.time.str.startswith('24'),'date'] = df.date + datetime.timedelta(days=1)

In [28]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00
61391  01/01/2017 24:00   9287.697168 2017-01-02  24:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00

In [29]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00
109438  06/26/2022 24:00  16630.511189 2022-06-27  24:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00

In [32]:
df.loc[109438,'time']

'24:00'

In [33]:
re.sub(r'24:','00:',df.loc[109438,'time'])

'00:00'

In [35]:
df.time.apply(lambda x: re.sub(r'24:','00:',x))

0         01:00
1         01:59
2         03:00
3         04:00
4         04:59
          ...
109530    20:00
109531    21:00
109532    22:00
109533    23:00
109534    00:00
Name: time, Length: 109535, dtype: object

In [37]:
df.time = df.time.apply(lambda x: re.sub(r'24:','00:',x))

In [38]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00
61391  01/01/2017 24:00   9287.697168 2017-01-02  00:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00

In [39]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00
109438  06/26/2022 24:00  16630.511189 2022-06-27  00:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00

In [40]:
df.date.astype(str)

0         2010-01-01
1         2010-01-01
2         2010-01-01
3         2010-01-01
4         2010-01-01
             ...
109530    2022-06-30
109531    2022-06-30
109532    2022-06-30
109533    2022-06-30
109534    2022-07-01
Name: date, Length: 109535, dtype: object

In [41]:
# 6. Check indices where known issue
df['new_datetime'] = df.date.astype(str) + ' ' + df.time

df

                datetime    ercot_load       date   time      new_datetime
0       2010-01-01 01:00   7775.456846 2010-01-01  01:00  2010-01-01 01:00
1       2010-01-01 01:59   7704.815982 2010-01-01  01:59  2010-01-01 01:59
2       2010-01-01 03:00   7650.575724 2010-01-01  03:00  2010-01-01 03:00
3       2010-01-01 04:00   7666.708317 2010-01-01  04:00  2010-01-01 04:00
4       2010-01-01 04:59   7744.960869 2010-01-01  04:59  2010-01-01 04:59
...                  ...           ...        ...    ...               ...
109530  06/30/2022 20:00  14700.132848 2022-06-30  20:00  2022-06-30 20:00
109531  06/30/2022 21:00  14637.633680 2022-06-30  21:00  2022-06-30 21:00
109532  06/30/2022 22:00  14543.743791 2022-06-30  22:00  2022-06-30 22:00
109533  06/30/2022 23:00  14065.386852 2022-06-30  23:00  2022-06-30 23:00
109534  06/30/2022 24:00  13484.378935 2022-07-01  00:00  2022-07-01 00:00

[109535 rows x 5 columns]

In [42]:
# 9. Convert datetime column to datetime
df['new_datetime'] = pd.to_datetime(df.new_datetime)

In [43]:
df.head()

           datetime   ercot_load       date   time        new_datetime
0  2010-01-01 01:00  7775.456846 2010-01-01  01:00 2010-01-01 01:00:00
1  2010-01-01 01:59  7704.815982 2010-01-01  01:59 2010-01-01 01:59:00
2  2010-01-01 03:00  7650.575724 2010-01-01  03:00 2010-01-01 03:00:00
3  2010-01-01 04:00  7666.708317 2010-01-01  04:00 2010-01-01 04:00:00
4  2010-01-01 04:59  7744.960869 2010-01-01  04:59 2010-01-01 04:59:00

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109535 entries, 0 to 109534
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   datetime      109535 non-null  object
 1   ercot_load    109534 non-null  float64
 2   date          109535 non-null  datetime64[ns]
 3   time          109535 non-null  object
 4   new_datetime  109535 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(2)
memory usage: 4.2+ MB

In [45]:
df.loc[61389:61393]

               datetime    ercot_load       date   time        new_datetime
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00 2017-01-01 22:00:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00 2017-01-01 23:00:00
61391  01/01/2017 24:00   9287.697168 2017-01-02  00:00 2017-01-02 00:00:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00 2017-01-02 01:00:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00 2017-01-02 02:00:00

In [46]:
df.loc[109436:109440]

                datetime    ercot_load       date   time        new_datetime
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00 2022-06-26 22:00:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00 2022-06-26 23:00:00
109438  06/26/2022 24:00  16630.511189 2022-06-27  00:00 2022-06-27 00:00:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00 2022-06-27 01:00:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00 2022-06-27 02:00:00

In [48]:
df.new_datetime = df.new_datetime.dt.round("H")

df

                datetime    ercot_load       date   time        new_datetime
0       2010-01-01 01:00   7775.456846 2010-01-01  01:00 2010-01-01 01:00:00
1       2010-01-01 01:59   7704.815982 2010-01-01  01:59 2010-01-01 02:00:00
2       2010-01-01 03:00   7650.575724 2010-01-01  03:00 2010-01-01 03:00:00
3       2010-01-01 04:00   7666.708317 2010-01-01  04:00 2010-01-01 04:00:00
4       2010-01-01 04:59   7744.960869 2010-01-01  04:59 2010-01-01 05:00:00
...                  ...           ...        ...    ...                 ...
109530  06/30/2022 20:00  14700.132848 2022-06-30  20:00 2022-06-30 20:00:00
109531  06/30/2022 21:00  14637.633680 2022-06-30  21:00 2022-06-30 21:00:00
109532  06/30/2022 22:00  14543.743791 2022-06-30  22:00 2022-06-30 22:00:00
109533  06/30/2022 23:00  14065.386852 2022-06-30  23:00 2022-06-30 23:00:00
109534  06/30/2022 24:00  13484.378935 2022-07-01  00:00 2022-07-01 00:00:00

[109535 rows x 5 columns]

In [ ]:
# 1. Datetime to string
# df.datetime = df.datetime[:19]
# 2. Pull out first 16 characters
# 3. Deconstruct into date and time columns
# 4. Convert date column into datetime format
# 5. Find any time where starts with 24, then for that index, update time to 00 and add one day to to date column
# 6. Check indices where known issue
# 7. Convert date column back to string
# 8. Concat date and time column >> datetime
# 9. Convert datetime column to datetime
# 10. Perform dt.round